# ColorWithTransparency Properties

---
The ColorWithTransparency type exposes the following members.
| Name| Description
---|---|---
| IsValidObject|  Specifies whether the .NET object represents a valid Revit entity.
Top
#### Reference
ColorWithTransparency Class
Autodesk.Revit.DB Namespace